
def part():

    dict_answers = {
        1: "-",
        2: "коллекционированием",
        3: "ходить",
        4: "о",
        5: "на",
        6: "-",
        7: "плаванием",
        8: "слушать",
        9: "-",
        10: "-"
    }

    wrong_answers = {
        1: ["в", "о", "на"],
        2: ["собрать", "соберёт", "собирать"],
        3: ["ходим", "ходят", "хожу"],
        4: ["в", "на", "с"],
        5: ["в", "о", "с"],
        6: ["о", "на", "в"],
        7: ["в плавании", "плавать", "плаваю"],
        8: ["слушают", "слушаю", "слушатель"],
        9: ["о", "в", "на"],
        10: ["о", "в", "на"]
    }

    questions_part_one  = [
        "Я очень заинтересован ... современным искусством.",
        "Мой друг увлекается ... старинных монет.",
        "Мы любим ... в театр по выходным.",
        "Она мечтает ... большом путешествии.",
        "Он хорошо играет ... гитаре.",
        "Дети смотрят ... интересный мультфильм.",
        "Я занимаюсь ... три раза в неделю.",
        "Им нравится ... классическую музыку.",
        "Ты собираешь ... марки или открытки?",
        "Она читает ... новые книги по психологии."
    ]
    for index, line in enumerate(questions_part_one, 1):
        print(questions_part_one[index-1])
        answer = input('Введите ответ: ')
        if answer == dict_answers[index]:
            print('Правильно:')

        else:
            print('Неверно')

def main():
    part()

if __name__ == "__main__":
    main()

